# ინდექსინგი ნიშნავს სიაში კონკრეტულ ელემენტზე წვდომას მისი ადგილმდებარეობით (ინდექსით).
# მაგალითად: list[0] მიუთითებს სიაში პირველ ელემენტზე

# ვქმნით დიდ სიას
my_list = ["ვაშლი", "მსხალი", "ბანანი", "ფორთოხალი", "ატამი", "საზამთრო", "ყურძენი", "ანანასი"]

# ვპრინტავთ ინდექსებით მიღებულ ელემენტებს
print("0 ინდექსი:", my_list[0])
print("1 ინდექსი:", my_list[1])
print("2 ინდექსი:", my_list[2])
print("3 ინდექსი:", my_list[3])
print("4 ინდექსი:", my_list[4])

# ვცვლით 5 ელემენტს ინდექსების მეშვეობით
my_list[0] = "კივი"
my_list[1] = "მანგო"
my_list[2] = "ლიმონი"
my_list[3] = "ხურმა"
my_list[4] = "ჟოლო"

# ვპრინტავთ შეცვლილ სიას
print("შეცვლილი სია:")
print(my_list)