ricxvi = int(input("შემოიყვანე რიცხვი 1- დან 10-მდე"))

if ricxvi > 0:
    print("დადებითია")

elif ricxvi < 0:
    print("უარყოფითია")
else:
    print("უდრის ნოლს")




num = int(input("შეიყვანე რიცხვი"))
if num % 2 == 0:
    print("ლუწია")

else:
    print("კენტია")


qula = int(input("შენი გამოცდის ქულა"))

if qula == 100:
    print("მალადეც")

elif qula <50:
    print("ვერ ჩააბარე")

#1)მომხმარებელს შემოაყვანინე რიცხვი და დაბეჭდე, დადებითია თუ უარყოფითი.
# 2)მომხმარებელს შემოაყვანინე რიცხვი და დაბეჭდე კენტის შემთხვევაში კენტი ლეწის შემთხვევაში ლუწი
# 3)უყურეთ ჩანაწერს 
# 4)მომხმარებელს შემოაყვანინე გამოცდის ქულა თუ მიიღო 100 დაბეჭდოს მალადეც თუ მიიღო 50 ნაკლები ვერ ჩააბარე 
