# 1
რიცხვი = int(input("ჩაწერე ერთი რიცხვი"))
გ = 0
while გ <= რიცხვი + 1:
    print(გ)
    გ += 1

# 2
რ = int(input("შეიყვანე კიდევ რიცხვი"))
if რ % 2:
    print("კენტი")
else:
    print("ლუწი")

# 3
დაიწყე = 1
დაასრულე = 100
for რიცხვი in range(დაიწყე, დაასრულე + 1):
    if რიცხვი % 2 == 0:
        print(რიცხვი, "- ლუწი")
    else:
        print(რიცხვი, "- კენტი")

# 4
პ1 = int(input("შეიყვანე ერთი რიცხვი: "))
პ2 = int(input("შეიყვანე კიდევ ერთი: "))
if პ1 > პ2:
    print("მაღალია:", პ1)
elif პ2 > პ1:
    print("მაღალია:", პ2)
else:
    print("ტოლია ორივე")


name = input("შეიყვანე შენი სახელი: ")
for i in range(10):
    print(name)