#1)შექმენით სია, სადაც გექნებათ 10 ელემენტი, შემდეგ შეცვალეთ ბოლო ელემენტი "Aleksandre" თი და საბოლოოდ უარყოფითი ინდექსებით გამოიტანეთ ბოლო ელემენტი
list = [1, 2, 3, 4, 5, 6, 7, 8 ,9 ,10]
list[-1] = "aleksandre"
print(list[-1])


# კომენტარებით ახსენით რას ნიშნავს რომ string არის immutable და list არის mutable
#string = შეუცვლელი (immutable)
#list = შეცვლადი (mutable)

# შექმენით სია 10 ცალი რიცხვით, შემდეგ მე 5 ელემენტი შეცვალეთ 5.12 ით, და შემდეგ ეს 5.12 გამოიტანეთ ნეგატიური ინდექსებით

list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
list[4] = 5.12
print(list[-6])


