i = 1
while i <= 5:
    print("ეს არის while ციკლი", i)
    i += 1





#while ციკლი ასრულებს მოქმედებას მანამ, სანამ მოცემული პირობა ჭეშმარიტია.

#for loop გამოიყენება მაშინ, როცა ვიცით რამდენჯერ უნდა შესრულდეს ციკლი (მაგალითად, სიაში ყველა ელემენტის გადარბენა).

#while loop for loop-ისგან იმით განსხვავდება რომ while loop-ს შეუძლია უსასრულოდ გამოიტანოს სანამ არ გავაჩერებთ


age = 12
count = 0
while count < age:
    print("გიორგი შევლიაკოვი")
    count += 1

for i in range (12):
    print("გიორგი შევლიაკოვი")



i = 10
while i <= 15:
    print(i)
    i+= 1

