#1) ახსენით რისთვის გამოიყენება upper(), lower(), capitalize(), find()

#1) upper() = დიდ ასოებად გამოაქვს ასოები.
#2) lower() = პატარა ასოებად გამოაქვს ასოები.
#3) capitalize() = პირველ ასოს დიდად გამოიტანს, ხოლო დანარჩენს პატარებად
#4) find() = რაიმე ასოს როდესაც ჩავწერთ find-ის გამოყენებით, რაც გვექნება მოცემული სიტყვა მაგალითად giorgi, რომელ
# ასოსაც დავწერთ, იმ ასოს ინდექს გამოიტანს.

#Dot ნოტაცია = ის იძახებს ფუნქციას მაგალითად upper ან lower-ს. და ასევე მის გარეშე კოდი არ იმუშავებს.
#ასევე Dot ნოტაცია აუცილებლად იწერება ფუნქციის წინ მაგალითად: BMW.Upper()

h = [1, 2, 3, 4, 5, 6]
print(len(h))
#len გამოაქვს ბოლო ელემენტი

num = [1, 2, 3, 4, 5, 6]
num.append(7)
print(num)
#რასაც append-ში ვწერთ ის გამოაქვს ელემენტების ბოლოს.

num = [1, 2, 3, 4, 5, 6]
num.insert(4, "Hello")
print(num)
#რომელიმე ინდექსის შემდგომ ამატებს სიტყვას. შეგვიძლია ასევე რიცხვიც დავამატოთ

num = [1, 2, 3, 4, 5, 6]
num.pop()
print(num)
#თუ არაფერს მივუწერთ pop-ს მაშინ ბოლო ელემენტს გააქრობს მაგრამ თუ მივუწერთ მაგალითად (2) წაშლის მეორე ინდექს.


#მეთოდში ვიყენებთ Dot ფუნქციას ხოლო ჩაშენებულ ფუნქციაში არა.
