def გადააქციე_წინადადება_სიტყვების_სიის_მეშვეობით(წინადადება):
    სიტყვები = წინადადება.split()
    დაბრუნება = ", ".join(სიტყვები)
    return დაბრუნება

def დაბეჭდე_სიტყვების_სიგრძეები(წინადადება):
    სიტყვები = წინადადება.split()
    for სიტყვა in სიტყვები:
        print(f"{სიტყვა}: {len(სიტყვა)} სიმბოლო")


def წაშალე_ზედმეტი_დაშორებები(წინადადება):
    სიტყვები = წინადადება.split()
    სუფთა_წინადადება = " ".join(სიტყვები)
    return სუფთა_წინადადება

def ჩასვი_ტირეები_სიტყვებს_შორის(წინადადება):
    სიტყვები = წინადადება.split()
    წინადადება_ტირეებით = "-".join(სიტყვები)
    return წინადადება_ტირეებით


def შეაბრუნე_სიტყვების_მიმდევრობა(წინადადება):
    სიტყვები = წინადადება.split()
    შებრუნებული = სიტყვები[::-1]
    ახალი_წინადადება = " ".join(შებრუნებული)
    return ახალი_წინადადება
