#კომენტარების სახით ახსენით რა არის ინდექსინგი, საიდან იწყება და როგორ ყალიბდება

#indexing = ინდექსინგი იწყება 0-დან, როდესაც მაგალითად list დავწერთ, ყველა ციფრს ექნება თავისი ინდექსი



#შექმენით სია 10 ცალი ელემენტით, შემდეგ მეხუთე ეელმენტი შეცალეთ 5 იანით, და გამოიტანეთ მეორე ელემენტის მერე ყველა არსებული ელემენტი ყაროფითი ინდექსების საშუალებით

list = [1, 2, 3, 4, 12, 6, 7, 8, 9, 10]
list[4] = 5
print(list[-8:])



#კომენტარების სახით ახსენით რა არის slicing და რაში ვიყენებთ მას, მოიყვანეთ რამდენიმე მაგალითი

#slicing = სლაისინგს ვიყენებთ ჩვენ როდესაც გვინდა რომელიმე სტრიქონიდან რაიმეს ამოჭრა

list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
list[-3] = 2
print(list[-2:])

list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]
print(list[::2])

#შექმენით სია 80 ცალი ელემენტით, შემდეგ 65 ელემენტი შეცვალეთ "gurami" თ და გამოიტანეთ იგი უარყოფითი ინდექსებით


list = list(range(1,81))
list[64] = "gurami"
print(list[-16])