#1) ახსენით რა განსხვავებაა index-ინგსადა სლასინგ შორის

#2) ჩამოთვალეთ ნასწავლი ლისტის ფუნქციები და ახსენით რას შვება თითული

#3) ახსენით რა განსხვავებაა return-სა და print-ს შორის

#4) ახსენით რა განსხვავებაა List-ებსადა ცვადებს შორის


#1 indexing -> ვიღებთ კონკრეტულ ელემენტს ინდექსის მიხედვით (მაგ: list[2])
# slicing -> ვიღებთ ელემენტების შუალედს/ნაკრებს (მაგ: list[1:4])


#2
#len
#len გამოაქვს ბოლო ელემენტი

#append
#რასაც append-ში ვწერთ ის გამოაქვს ელემენტების ბოლოს.

#insert
#რომელიმე ინდექსის შემდგომ ამატებს სიტყვას. შეგვიძლია ასევე რიცხვიც დავამატოთ

#Pop
#თუ არაფერს მივუწერთ pop-ს მაშინ ბოლო ელემენტს გააქრობს მაგრამ თუ მივუწერთ მაგალითად (2) წაშლის მეორე ინდექს.

#Join
#სიტყვებს აერთებს.

#Split
#თითოეულ ელემენტს გამოყოფს space-ით

#3
# return -> ფუნქციიდან აბრუნებს მნიშვნელობას, რომლითაც მერე შეგვიძლია ვიმუშაოთ
# print -> ეკრანზე გამოაქვს ტექსტი, მაგრამ ფუნქციიდან არაფერს აბრუნებს

#4
# ცვლადებში ვინახავთ ერთ რაიმეს
# ხოლო List-ებში ბევრ რაიმეს ვინახავთ ერთად
